{
  "intents": 
  [
    {
      "tag": "greetings",
      "patterns": [
        "hello",
        "hey",
        "hi",
        "good day",
        "Greetings",
        "what's up?",
        "how is it going?"
      ],
      "responses": [
        "Hello!",
        "Hey!",
        "What can I do for you?"
      ]
    },
    {
      "tag": "name",
      "patterns": [
        "what is your name",
        "name",
        "what's your name",
        "who are you",
        "what should I call you"
      ],
      "responses": [
        "You can call me ChatBotFOEUOJ",
        "I'm ChatBotFOEUOJ",
        "I'm ChatBotFOEUOJ your virtual assistant"
      ]
    },
    {
      "tag": "courseDuration",
      "patterns": [
        "how long is the engineering degree",
        "how long will it take to complete the engineering degree"
      ],
      "responses": [
        "The FOE UOJ offers a 4 year long engineering degree"
      ]
    },

    {
      "tag": "program structure",
      "patterns": [
        "What program will students follow?",
        "Tell me about the structure of the academic program."
      ],
      "responses": [
        "Students will follow the General Program during the first three semesters and the Special Program in the last five semesters."
      ]
    },
    {
      "tag": "industrial training",
      "patterns": [
        "Is there any industrial training requirement?",
        "Tell me about the industrial training for students."
      ],
      "responses": [
        "Each student must complete Industrial Training of 24 weeks at the end of the 7th semester."
      ]
    },
    {
      "tag": "medium",
      "patterns": [
        "In what language are the lectures conducted?",
        "What is the medium of instruction?"
      ],
      "responses": [
        "The medium of instruction is English."
      ]
    },
    {
      "tag": "credits",
      "patterns": [
        "How many credits are offered in one semester",
        "Number of credit per semester",
        "How many credits can I register for in one semester"
      ],
      "responses": [
			"Each student is offered a maximum of 24 credits to register for each semester"
			]
    },
    {
      "tag": "exceptions to credit limit",
      "patterns": [
        "Are there any exceptions to the maximum credit limit?",
        "How can a student exceed the credit limit?"
      ],
      "responses": [
        "Under exceptional circumstances, deviations to these limits may be permitted by the Dean, with the consent of the heads of the departments. This is subject to the approval of the Faculty Board."
      ]
    },
    {
      "tag": "total academic credits",
      "patterns": [
        "What are the total academic credits for the degree program?",
        "Tell me about the overall academic credit requirements."
      ],
      "responses": [
        "During the entire degree program, a student is required to earn 153 academic credits, including 6 from Industrial Training."
      ]
    },
    {
      "tag": "academic credits for non technical electives",
      "patterns": [
        "Tell me about the breakdown of academic credits for non technical electives.",
        "What is the credit requirements for non technical electives?"
      ],
      "responses": [
        "The total number of earned academic credits for non technical electives should include a minimum of 15 academic credits for studies in management, engineering economics, and communication, and 5 academic credits in humanities, social sciences, and engineering ethics."
      ]
    },
    {
      "tag": "academic credits breakdown",
      "patterns": [
        "What are the specific requirements for academic credits?",
        "Tell me about the breakdown of academic credits."
      ],
      "responses": [
        "The total number of earned academic credits should include a minimum of 15 academic credits for studies in management, engineering economics, and communication, and 5 academic credits in humanities, social sciences, and engineering ethics."
      ]
    },
    {
      "tag": "engineering_curriculum",
      "patterns": [
        "Tell me about the engineering curriculum at the Faculty of Engineering, University of Jaffna.",
        "What is the structure of the engineering program?"
      ],
      "responses": [
        "Students enrolled in the Faculty of Engineering follow a unique curriculum. In the first three semesters, they focus on Common Courses in Engineering Fundamentals with basic designs, offering a special emphasis on day-to-day utilities and their designs. This approach provides an in-depth understanding and an easy learning path as students work with basic designs from familiar entities.",
        "After the third semester, students are empowered to delve into detailed designs with codes of practices. Specialization options are introduced from the fourth semester onward, aligning with the curriculum designed to meet SLQF Level 7 requirements."
      ]
    },
    {
      "tag": "general program courses",
      "patterns": [
        "Tell me about the General Program.",
        "What are the academic credit requirements for the General Program?"
      ],
      "responses": [
        "In the General Program, there are compulsory core course units totaling 54 academic credits.",
        "Additionally, the Soft-skill Development Program in the General Program amounts to 3 academic credits."
      ]
    },
    {
      "tag": "soft-skill development program",
      "patterns": [
        "Tell me about the soft-skill development Program."
      ],
      "responses": [
        "In the General Program, there are compulsory core course units totaling 54 academic credits.",
        "Additionally, the Soft-skill Development Program in the General Program amounts to 3 academic credits."
      ]
    },
    {
      "tag": "special program courses",
      "patterns": [
        "Tell me about the Special Program.",
        "What are the academic credit requirements for the Special Program?"
      ],
      "responses": [
        "The Special Program spans five semesters, from the 4th semester to the 8th semester.",
        "In the Special Program, there are compulsory core course units, technical elective course units, and non-technical elective course units, totaling 90 academic credits.",
        "Additionally, mandatory industrial trainings (I and II) in the Special Program amount to 6 academic credits."
      ]
    },
    {
      "tag": "teaching method",
      "patterns": [
        "What teaching and assessment methods are used at the Faculty?"
      ],
      "responses": [
        "The Faculty employs outcomes-based education (OBE) methods. Teaching aligns with intended learning outcomes (ILOs), and assessments verify students' competency in achieving these outcomes."
      ]
    },
    {
      "tag": "teaching_panel",
      "patterns": [
        "Tell me about the composition of the teaching panel.",
        "Who is part of the teaching panel?"
      ],
      "responses": [
        "The teaching panel consists of a course coordinator, lecturer(s), and a moderator."
      ]
    },
    {
      "tag": "teaching panel roles",
      "patterns": [
        "What are the roles of the teaching panel members?",
        "Tell me about the responsibilities of the teaching panel."
      ],
      "responses": [
        "Lecturer(s) engages in both teaching and assessment of the particular course unit.",
        "The course coordinator, with the assistance of the course moderator, finalizes the marks and grades.",
        "The external reviewer provides feedback which will be used to revise and update the course before offering it the next time"
      ]
    },
    {
      "tag": "student assessment",
      "patterns": [
        "How are students assessed in each course unit?",
        "Tell me about the assessment methods for students."
      ],
      "responses": [
        "The performance of students in each course unit is assessed through formative (in-course) assessments and evaluated by summative (end of course) assessments."
      ]
    },
    {
      "tag": "in-course assessment",
      "patterns": [
        "What are the requirements for the in-course assessment",
        "Tell me about the in-course assessment for students."
      ],
      "responses": [
        "Incourse assessment includes Assignment, Quiz, Student Presentation, Oral Examination, Lab/Field Reports, and Mid Semester Examination.",
        "The evaluation criteria for passing the in-course assessment is to ensure that your assessment marks is greater than 35%."
      ]
    },
    {
      "tag": "end of course assessment",
      "patterns": [
        "What are the requirements for the end of course assessment",
        "Tell me about the end of course assessment for students."
      ],
      "responses": [
        "End of course assessment includes only the End semester marks. The pass criteria for end semester assessment is to ensure that your end semester marks is greater than 35%."
      ]
    },
    {
      "tag": "end exam schedule",
      "patterns": [
        "What is date and time of end exam?",
        "What is the schedule of the end exam?",
        "Tell me about the scheduling of end exams."
      ],
      "responses": [
        "The date and time of the end exams are decided by the Office of the Dean at the beginning of each semester. They will be sent to you via Outlook 3-4 weeks before the exam."
      ]
    },
    {
      "tag": "industrial training supervision",
      "patterns": [
        "Who supervises the Industrial Training?",
        "Tell me about the supervision of Industrial Training."
      ],
      "responses": [
        "Industrial Training will be supervised by the National Apprentice and Industrial Training Authority (NAITA)."
      ]
    },
    {
      "tag": "attendance requirements",
      "patterns": [
        "What are the attendance requirements for earning a grade?",
        "Tell me about the minimum attendance level for exam eligibility."
      ],
      "responses": [
        "Each student is required to have a minimum attendance level of 80% in a course unit to be eligible to earn a grade."
      ]
    },
    {
      "tag": "attendance failure",
      "patterns": [
        "What happens if a student fails to meet attendance requirements?",
        "Tell me about the consequences for insufficient attendance."
      ],
      "responses": [
        "If a student fails to satisfy attendance requirements in a course unit, they will not be allowed to appear for the End examination, and the student shall be assigned a Grade of 'E'."
      ]
    },
    {
      "tag": "absence",
      "patterns": [
        "What should I do if I was absent for an in-class activity?",
        "What is the procedure I should follow if I missed an in-class activity."
      ],
      "responses": [
        "If a student is absent for an in-class activity, assessment, or evaluation, they should inform the Office of the Dean within one week from the date of absence. Supporting documents should be submitted within two weeks."
      ]
    },
    {
      "tag": "attendance reattempt",
      "patterns": [
        "Do I need to attend lectures if I already satisfied the 80% attendance requirement in my first attempt?",
        "For my reattempt, should I attend lectures?"
      ],
      "responses": [
        "Student who satisfies 80% attendance requirement of a course unit may carry forward the students attendance record when the student reattempts."
      ]
    },
    {
      "tag": "display results",
      "patterns": [
        "When will the results be displayed?"
      ],
      "responses": [
        "The semester results will be available for display once they are appoved by the results board. This usually takes 3-4 weeks following the end examination."
      ]
    },
    {
      "tag": "GPA and honors",
      "patterns": [
        "How are GPA and Class of Honors decided?",
        "Tell me about the process of determining GPA and Class of Honors."
      ],
      "responses": [
        "At the end of the eighth semester, the Examination Branch of the university shall decide the GPA and the Class of Honors for students who have fulfilled the requirements for the degree program in that academic year. The results are then forwarded to the Senate for confirmation."
      ]
    },
    {
      "tag": "academic advisors",
      "patterns": [
        "How do I find out who my Academic advisor is?",
        "Who is my academic advisor?"
      ],
      "responses": [
        "At the beginning of each academic year, Academic Advisers are appointed from among the members of the academic staff of the Faculty. The AR office will circulate a document containing the details of the academic advisors for each student. Academic advisors may change after each semester."
      ]
    },
    {
      "tag": "Results D",
      "patterns": [
        "I got a D results for one of my subjects. What does it mean?",
        "What does a D mean in my results"
      ],
      "responses": [
        "The results D refers to marks percetnage in between 35-39% which means you have not satisfied the criteria to obtain a pass. Consult the respective coordinator or lecturer for more details."
      ]
    },
    {
      "tag": "GPA",
      "patterns": [
        "what is meant by GPA?",
        "what is GPA"
      ],
      "responses": [
        "GPA stands for graded point average. The Grade Point Average (GPA) is the weighted average of the GPV secured by the student in the course units that are valid for calculating the GPA."
      ]
    },
    {
      "tag": "GPA invalid subjects",
      "patterns": [
        "What are the subjects that are not considered when calculating GPA?",
        "which subjects do not qualify for GPA calculation?"
      ],
      "responses": [
        "All course units excluding Industrial training (6 credits) will be considered. The remaining 147 credits will be considered in the GPA calculation."
      ]
    },
    {
      "tag": "GPA rounding",
      "patterns": [
        "How is the GPA rounded off?",
        "To what decimal places is the GPA calculated?"
      ],
      "responses": [
        "The GPA is rounded up to the nearest 0.05. A student having a GPA of 3.651 will be rounded to 3.70 however a student with a GPA of 3.650 will be rounded to 3.60."
      ]
    },
    {
      "tag": "program transition requirements",
      "patterns": [
        "What are the criteria for transitioning from the General Program to the Special Program?",
        "Tell me about the requirements to move from the General Program to the Special Program.",
        "How does a student progress from the General Program to the Special Program?"
      ],
      "responses": [
        "To proceed from the General Program to the Special Program, a student should obtain grades 'C' or above in course units, aggregating to at least 42 academic credits out of 54 offered during the General Program. The student should  also obtain grade `C' or above in English Language Enhancement course unit."
      ]
    },
    {
      "tag": "grade improvement",
      "patterns": [
        "Can a student with a grade below 'C' re-attempt assessments for a course unit?",
        "Tell me how I can improvie my grade which is below 'C'.",
        "What options does a student have to enhance a grade below 'C'?"
      ],
      "responses": [
        "A student may re-attempt the required assessment/evaluation to improve the grade. Consult the respective lecturer or coordinator for more details regarding your grade."
      ]
    },
    {
      "tag": "course completion timeframe",
      "patterns": [
        "What is the time limit for completing a course unit on re-attempt?",
        "How long does a student have to complete a re-attempted course unit for graduation?"
      ],
      "responses": [
        "A student who re-attempts a particular course unit must complete it within eight academic years since the student registered for the degree program to be eligible for graduation."
      ]
    },
    {
      "tag": "bsceng_honors_eligibility",
      "patterns": [
        "What are the eligibility criteria for receiving a BScEng Honors degree?",
        "Tell me about the requirements for obtaining a BScEng Honors degree with Class eligibility or Pass.",
        "How can a student be eligible for a BScEng Honors degree?"
      ],
      "responses": [
        "To receive a BScEng Honors degree with Class eligibility or Pass, a student must have obtained grade 'C' or above in all claimed course units and earned a total of 153 academic credits. This includes 120 academic credits from core course units, 12 from technical elective course units, 12 from complementary course units, 6 from industrial training, and 3 from the soft skill development program."
      ]
    },


    {
      "tag": "Location",
      "patterns": [
        "location",
        "where is it located",
        "what is the location of the university"
      ],
      "responses": [
        "Faculty of Engineering, University of Jaffna is located in Ariviyal Nagar, Kilinochchi"
      ]
    },
    {
      "tag": "semesters",
      "patterns": [
        "how many semesters are there in a year",
        "how many semesters one should study in a year"
      ],
      "responses": [
        "There are two semesters in a year."
      ]
    },
    {
      "tag": "sem duration",
      "patterns": [
        "how many months are there in a semester",
        "how long will be a single semester"
      ],
      "responses": [
        "The single semester will be around 15 weeks or 4 months."
      ]
    },
    {
      "tag": "student requirements",
      "patterns": [
        "what are the student requirements for admission",
        "entry requirements",
        "admission requirements"
      ],
      "responses": [
        "for BSc.Eng, the minimum requirement is for candidates to pass their GCE Advanced Level Examinations in the following subjects: Combined Mathematics, Physics and Chemistry"
      ]
    },
    {
      "tag": "lectures",
      "patterns": [
        "how many lectures will be there in a day",
        "how long are the lectures?"
      ],
      "responses": [
        "Generally there are 4 lectures per day. Each lecture will be of 55 minutes. In the evenings, you will have the practical sessions."
      ]
    },

    {
      "tag": "add and drop",
      "patterns": [
        "Can students add or drop course modules?",
        "What is the procedure for adding or dropping modules?"
      ],
      "responses": [
        "A student is allowed to ADD or DROP course modules within the first two weeks from the fifth semester onwards. Students need to download the ADD and DROP form from the faculty website and fill in the necessary details and obtain the respective advisor's signature and submit it to the AR office before the deadline."
      ]
    },
    {
      "tag": "hours",
      "patterns": [
        "what are your hours",
        "when are you guys open",
        "what your hours of operation"
      ],
      "responses": [
		"FOE UOJ is open from Monday to Friday 08 AM to 4 PM, excepting public holidays "      ]
    },
    {
      "tag": "funActivities",
      "patterns": [
        "will there be any extra curriculum activities?",
        "does the college conducts any fun program"
      ],
      "responses": [
		"FOE UOJ organizes EWEEK every Year along with E-legends cricket match"      ]
    },
    {
      "tag": "facilities",
      "patterns": [
        "what facilities are provided by the college?",
        "what are the facilities of college for students",
        "what are the college infrastructures "
      ],
      "responses": [
        "With excellent education facilities, FOE UOJ provides various other facilities like 24 hours internet, library, discusson room, canteen, and student service for any students queries."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "cya",
        "See you later",
        "Goodbye",
        "I am leaving",
        "Have a Good Day",
        "bye",
        "see ya"
      ],
      "responses": [
        "Sad to see you go :(",
        "Talk you later",
        "Goodbye"
      ]
    },
    {
      "tag": "invalid",
      "patterns": [
        "",
        "gvsd",
        "asbhk"
      ],
      "responses": [
        "Sorry, can't understand you",
        "Please give me more info",
        "Not sure I understand"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful",
        "Awesome, thanks",
        "Thanks for helping me"
      ],
      "responses": [
        "Happy to help!",
        "Any time!",
        "My pleasure"
		  ]
    },
	  {
      "tag": "Contact",
      "patterns": [
        "what is contact no ",
        "how can I contact FOE UOJ",
        "how can I make a call to FOE UOJ",
        "What is phone no. of FOE UOJ",
        "Mobile No. of FOE UOJ"
      ],
      "responses": [
        "You can call us at +94-021-2062161 or mail us at admin@eng.jfn.ac.lk"
	    ]
    }
  ]
}